[{
  "_id": {
    "$oid": "640cf12f961e4bcd88a590a8"
  },
  "blogTitle": "Angkor Wat",
  "blogContent": "Since the 1990s, Angkor Wat has become a major tourist destination. In 1993, there were only 7,650 visitors to the site; by 2004, government figures show that 561,000 foreign visitors had arrived in Siem Reap province that year, approximately 50% of all foreign tourists in Cambodia. The number reached over a million in 2007, and over two million by 2012. Most visited Angkor Wat, which received over two million foreign tourists in 2013, and 2.6 million by 2018.\r\n\r\nThe site was managed by the private SOKIMEX group between 1990 and 2016, which rented it from the Cambodian government. The influx of tourists has so far caused relatively little damage, other than some graffiti. Ropes and wooden steps have been introduced to protect the bas-reliefs and floors, respectively. Tourism has also provided some additional funds for maintenance—as of 2000 approximately 28% of ticket revenues across the entire Angkor site was spent on the temples—although most work is carried out by teams sponsored by foreign governments rather than by the Cambodian authorities.",
  "blogTag": [
    "tour",
    "travel",
    "tourist"
  ],
  "blogViews": 4,
  "blogImage": "bimage_1678569775707.jpg",
  "likes": 0,
  "dislikes": 0,
  "status": "approved",
  "comments": [
    {
      "$oid": "640d3aff24889872ecbbdb58"
    }
  ],
  "blogAuthor": {
    "$oid": "640cefd5961e4bcd88a59093"
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1678569775724"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1678588671912"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "640cf216961e4bcd88a590c7"
  },
  "blogTitle": "Varanasi",
  "blogContent": "Tourism is Varanasi's second most important industry. Domestic tourist most commonly visit for religious purposes while foreign tourist visit for ghats along River Ganges and Sarnath. Most domestic tourists are from Bihar, West Bengal, Madhya Pradesh, and other parts of Uttar Pradesh, while the majority of foreign tourists are from Sri Lanka and Japan. The peak tourist season falls between October and March. In total, there are around 12,000 beds available in the city, of which about one half are in inexpensive budget hotels and one third in dharamsalas. Overall, Varanasi's tourist infrastructure is not well developed.",
  "blogTag": [
    "tourist"
  ],
  "blogViews": 1,
  "blogImage": "bimage_1678570006535.jpg",
  "likes": 0,
  "dislikes": 0,
  "status": "approved",
  "comments": [],
  "blogAuthor": {
    "$oid": "640ceffa961e4bcd88a59096"
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1678570006547"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1678587832955"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "640cf2f2961e4bcd88a590e4"
  },
  "blogTitle": "Niagara Falls",
  "blogContent": "Peak visitor traffic occurs in the summertime, when Niagara Falls is both a daytime and evening attraction. From the Canadian side, floodlights illuminate both sides of the falls for several hours after dark (until midnight). The number of visitors in 2007 was expected to total 20 million, and by 2009 the annual rate was expected to top 28 million tourists.\r\n\r\nThe oldest and best known tourist attraction at Niagara Falls is the Maid of the Mist boat cruise, named for an ancient Ongiara Indian mythical character, which has carried passengers into the rapids immediately below the falls since 1846. Cruise boats operate from boat docks on both sides of the falls, with the Maid of the Mist operating from the American side and Hornblower Cruises (originally Maid of the Mist until 2014) from the Canadian side.\r\n\r\nFrom the U.S. side, American Falls can be viewed from walkways along Prospect Point Park, which also features the Prospect Point Observation Tower and a boat dock for the Maid of the Mist. Goat Island offers more views of the falls and is accessible by foot and automobile traffic by bridge above American Falls. From Goat Island, the Cave of the Winds is accessible by elevator and leads hikers to a point beneath Bridal Veil Falls. Also on Goat Island are the Three Sisters Islands, the Power Portal where a statue of Nikola Tesla (the inventor whose patents for the AC induction motor and other devices for AC power transmission helped make the harnessing of the falls possible) can be seen, and a walking path that enables views of the rapids, the Niagara River, the gorge, and all of the falls. Most of these attractions lie within the Niagara Falls State Park.",
  "blogTag": [
    "nature"
  ],
  "blogViews": 1,
  "blogImage": "bimage_1678570226291.jpg",
  "likes": 0,
  "dislikes": 0,
  "status": "approved",
  "comments": [],
  "blogAuthor": {
    "$oid": "640cf010961e4bcd88a59099"
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1678570226337"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1678587817457"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "640cf49f961e4bcd88a59101"
  },
  "blogTitle": "Goa",
  "blogContent": "Tourism is generally focused on the coastal areas of Goa, with lower tourist activity inland. In 2010, there were more than 2 million tourists reported to have visited Goa, about 1.2  million of whom were from abroad. As of 2013, Goa was a destination of choice for Indian and foreign tourists, particularly Britons and Russians, with limited means who wanted to party. The state was hopeful that changes could be made which would attract a more upscale demographic.\r\n\r\nGoa stands 6th in the Top 10 Nightlife cities in the world in National Geographic Travel. Notable nightclubs in Goa include Chronicle, Mambos and Sinq. One of the biggest tourist attractions in Goa is water sports. Beaches like Baga and Calangute offer jet-skiing, parasailing, banana boat rides, water scooter rides, and more. Patnem beach in Palolem stood third in CNN Travel's Top 20 Beaches in Asia.\r\n\r\nOver 450 years of Portuguese rule and the influence of the Portuguese culture presents to visitors to Goa a cultural environment that is not found elsewhere in India. Goa is often described as a fusion between Eastern and Western culture with Portuguese culture having a dominant position in the state be it in its architectural, cultural or social settings. The state of Goa is famous for its excellent beaches, churches, and temples. The Bom Jesus Cathedral, Fort Aguada and a new wax museum on Indian history, culture and heritage in Old Goa are other tourism destinations.",
  "blogTag": [
    "love"
  ],
  "blogViews": 0,
  "blogImage": "bimage_1678570655913.jpg",
  "likes": 0,
  "dislikes": 0,
  "status": "approved",
  "comments": [],
  "blogAuthor": {
    "$oid": "640cf025961e4bcd88a5909c"
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1678570655920"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1678570666369"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "640e1a6244af5f8ab9616cdd"
  },
  "blogTitle": "Quebec City",
  "blogContent": "Quebec City is referred to as the National Capital in the province. Much of the business here is of the administrative and bureaucratic nature, which would normally make a city quite dull. Fortunately, the city has a remarkable history, as the fortress capital of New France since the 16th century. Although the town's day-to-day life leaves things a little yawny at times, the vibrant historical centre makes for an incredible visit.\r\n\r\nQuebec was first settled by Europeans in 1608 in an \"Habitation\" led by Samuel de Champlain, and celebrated its 400th anniversary in 2008. The generally accepted dates of Champlain's arrival in the city, July 3rd and 4th, were marked with major celebrations. The area was also inhabited by Native peoples for many centuries before the arrival of the Europeans, and their ongoing presence has been notable since then.\r\n\r\nWhen it was founded by the French to make a claim in the New World, the name Quebec referred to just the city. It is an Aboriginal word for \"where the river narrows\" as the St. Lawrence River dramatically closes in just east of the city. It rests on 65-m-high (200-foot) cliffs with stunning views of the surrounding Laurentian Mountains and the St. Lawrence River. Under French rule from 1608 to 1759, the major industries were the fur and lumber trades. The French lost the city and the whole colony of New France to the British in the Battle of the Plains of Abraham in 1759. Much of the French nobility returned to France, and the British assumed rule over the remaining French population. The rulers of the colony allowed the French to retain their language and religion, leaving much of the culture intact. In the 1840s, there was an influx of Irish immigrants during the Potato Famine. Due to cholera and typhus outbreaks, ships were quarantined at Grosse Isle to the east of the city past l'Île d'Orléans. The bodies of those who perished on the journey and while in quarantine are buried there. The city remained under British rule until 1867 when Canada West (Quebec) and Canada East (Ontario) joined New Brunswick and Nova Scotia to form the Dominion of Canada.",
  "blogTag": [
    "citytour"
  ],
  "blogViews": 0,
  "blogImage": "bimage_1678645858057.jpg",
  "likes": 0,
  "dislikes": 0,
  "status": "approved",
  "comments": [],
  "blogAuthor": {
    "$oid": "6403ad8316894bbe22153daa"
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1678645858077"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1678645878813"
    }
  },
  "__v": 0
}]